RohithSai4518/Embeded_Systems/include/registers/reg_samd21.h
/**
 * @file reg_samd21.h
 * @brief Microchip SAMD21 ARM Cortex-M0+ Peripheral Registers
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_SAMD21_H
#define REG_SAMD21_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM0_TypeDef;
#define SAMD_SERCOM0 ((SAMD_SERCOM0_TypeDef *)(0x42000800UL + 0 * 0x400UL))

#define SAMD_SERCOM0_BIT_0 (1UL << 0)
#define SAMD_SERCOM0_BIT_1 (1UL << 1)
#define SAMD_SERCOM0_BIT_2 (1UL << 2)
#define SAMD_SERCOM0_BIT_3 (1UL << 3)
#define SAMD_SERCOM0_BIT_4 (1UL << 4)
#define SAMD_SERCOM0_BIT_5 (1UL << 5)
#define SAMD_SERCOM0_BIT_6 (1UL << 6)
#define SAMD_SERCOM0_BIT_7 (1UL << 7)
#define SAMD_SERCOM0_BIT_8 (1UL << 8)
#define SAMD_SERCOM0_BIT_9 (1UL << 9)
#define SAMD_SERCOM0_BIT_10 (1UL << 10)
#define SAMD_SERCOM0_BIT_11 (1UL << 11)
#define SAMD_SERCOM0_BIT_12 (1UL << 12)
#define SAMD_SERCOM0_BIT_13 (1UL << 13)
#define SAMD_SERCOM0_BIT_14 (1UL << 14)
#define SAMD_SERCOM0_BIT_15 (1UL << 15)
#define SAMD_SERCOM0_BIT_16 (1UL << 16)
#define SAMD_SERCOM0_BIT_17 (1UL << 17)
#define SAMD_SERCOM0_BIT_18 (1UL << 18)
#define SAMD_SERCOM0_BIT_19 (1UL << 19)
#define SAMD_SERCOM0_BIT_20 (1UL << 20)
#define SAMD_SERCOM0_BIT_21 (1UL << 21)
#define SAMD_SERCOM0_BIT_22 (1UL << 22)
#define SAMD_SERCOM0_BIT_23 (1UL << 23)
#define SAMD_SERCOM0_BIT_24 (1UL << 24)
#define SAMD_SERCOM0_BIT_25 (1UL << 25)
#define SAMD_SERCOM0_BIT_26 (1UL << 26)
#define SAMD_SERCOM0_BIT_27 (1UL << 27)
#define SAMD_SERCOM0_BIT_28 (1UL << 28)
#define SAMD_SERCOM0_BIT_29 (1UL << 29)
#define SAMD_SERCOM0_BIT_30 (1UL << 30)
#define SAMD_SERCOM0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM1_TypeDef;
#define SAMD_SERCOM1 ((SAMD_SERCOM1_TypeDef *)(0x42000800UL + 1 * 0x400UL))

#define SAMD_SERCOM1_BIT_0 (1UL << 0)
#define SAMD_SERCOM1_BIT_1 (1UL << 1)
#define SAMD_SERCOM1_BIT_2 (1UL << 2)
#define SAMD_SERCOM1_BIT_3 (1UL << 3)
#define SAMD_SERCOM1_BIT_4 (1UL << 4)
#define SAMD_SERCOM1_BIT_5 (1UL << 5)
#define SAMD_SERCOM1_BIT_6 (1UL << 6)
#define SAMD_SERCOM1_BIT_7 (1UL << 7)
#define SAMD_SERCOM1_BIT_8 (1UL << 8)
#define SAMD_SERCOM1_BIT_9 (1UL << 9)
#define SAMD_SERCOM1_BIT_10 (1UL << 10)
#define SAMD_SERCOM1_BIT_11 (1UL << 11)
#define SAMD_SERCOM1_BIT_12 (1UL << 12)
#define SAMD_SERCOM1_BIT_13 (1UL << 13)
#define SAMD_SERCOM1_BIT_14 (1UL << 14)
#define SAMD_SERCOM1_BIT_15 (1UL << 15)
#define SAMD_SERCOM1_BIT_16 (1UL << 16)
#define SAMD_SERCOM1_BIT_17 (1UL << 17)
#define SAMD_SERCOM1_BIT_18 (1UL << 18)
#define SAMD_SERCOM1_BIT_19 (1UL << 19)
#define SAMD_SERCOM1_BIT_20 (1UL << 20)
#define SAMD_SERCOM1_BIT_21 (1UL << 21)
#define SAMD_SERCOM1_BIT_22 (1UL << 22)
#define SAMD_SERCOM1_BIT_23 (1UL << 23)
#define SAMD_SERCOM1_BIT_24 (1UL << 24)
#define SAMD_SERCOM1_BIT_25 (1UL << 25)
#define SAMD_SERCOM1_BIT_26 (1UL << 26)
#define SAMD_SERCOM1_BIT_27 (1UL << 27)
#define SAMD_SERCOM1_BIT_28 (1UL << 28)
#define SAMD_SERCOM1_BIT_29 (1UL << 29)
#define SAMD_SERCOM1_BIT_30 (1UL << 30)
#define SAMD_SERCOM1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM2_TypeDef;
#define SAMD_SERCOM2 ((SAMD_SERCOM2_TypeDef *)(0x42000800UL + 2 * 0x400UL))

#define SAMD_SERCOM2_BIT_0 (1UL << 0)
#define SAMD_SERCOM2_BIT_1 (1UL << 1)
#define SAMD_SERCOM2_BIT_2 (1UL << 2)
#define SAMD_SERCOM2_BIT_3 (1UL << 3)
#define SAMD_SERCOM2_BIT_4 (1UL << 4)
#define SAMD_SERCOM2_BIT_5 (1UL << 5)
#define SAMD_SERCOM2_BIT_6 (1UL << 6)
#define SAMD_SERCOM2_BIT_7 (1UL << 7)
#define SAMD_SERCOM2_BIT_8 (1UL << 8)
#define SAMD_SERCOM2_BIT_9 (1UL << 9)
#define SAMD_SERCOM2_BIT_10 (1UL << 10)
#define SAMD_SERCOM2_BIT_11 (1UL << 11)
#define SAMD_SERCOM2_BIT_12 (1UL << 12)
#define SAMD_SERCOM2_BIT_13 (1UL << 13)
#define SAMD_SERCOM2_BIT_14 (1UL << 14)
#define SAMD_SERCOM2_BIT_15 (1UL << 15)
#define SAMD_SERCOM2_BIT_16 (1UL << 16)
#define SAMD_SERCOM2_BIT_17 (1UL << 17)
#define SAMD_SERCOM2_BIT_18 (1UL << 18)
#define SAMD_SERCOM2_BIT_19 (1UL << 19)
#define SAMD_SERCOM2_BIT_20 (1UL << 20)
#define SAMD_SERCOM2_BIT_21 (1UL << 21)
#define SAMD_SERCOM2_BIT_22 (1UL << 22)
#define SAMD_SERCOM2_BIT_23 (1UL << 23)
#define SAMD_SERCOM2_BIT_24 (1UL << 24)
#define SAMD_SERCOM2_BIT_25 (1UL << 25)
#define SAMD_SERCOM2_BIT_26 (1UL << 26)
#define SAMD_SERCOM2_BIT_27 (1UL << 27)
#define SAMD_SERCOM2_BIT_28 (1UL << 28)
#define SAMD_SERCOM2_BIT_29 (1UL << 29)
#define SAMD_SERCOM2_BIT_30 (1UL << 30)
#define SAMD_SERCOM2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM3_TypeDef;
#define SAMD_SERCOM3 ((SAMD_SERCOM3_TypeDef *)(0x42000800UL + 3 * 0x400UL))

#define SAMD_SERCOM3_BIT_0 (1UL << 0)
#define SAMD_SERCOM3_BIT_1 (1UL << 1)
#define SAMD_SERCOM3_BIT_2 (1UL << 2)
#define SAMD_SERCOM3_BIT_3 (1UL << 3)
#define SAMD_SERCOM3_BIT_4 (1UL << 4)
#define SAMD_SERCOM3_BIT_5 (1UL << 5)
#define SAMD_SERCOM3_BIT_6 (1UL << 6)
#define SAMD_SERCOM3_BIT_7 (1UL << 7)
#define SAMD_SERCOM3_BIT_8 (1UL << 8)
#define SAMD_SERCOM3_BIT_9 (1UL << 9)
#define SAMD_SERCOM3_BIT_10 (1UL << 10)
#define SAMD_SERCOM3_BIT_11 (1UL << 11)
#define SAMD_SERCOM3_BIT_12 (1UL << 12)
#define SAMD_SERCOM3_BIT_13 (1UL << 13)
#define SAMD_SERCOM3_BIT_14 (1UL << 14)
#define SAMD_SERCOM3_BIT_15 (1UL << 15)
#define SAMD_SERCOM3_BIT_16 (1UL << 16)
#define SAMD_SERCOM3_BIT_17 (1UL << 17)
#define SAMD_SERCOM3_BIT_18 (1UL << 18)
#define SAMD_SERCOM3_BIT_19 (1UL << 19)
#define SAMD_SERCOM3_BIT_20 (1UL << 20)
#define SAMD_SERCOM3_BIT_21 (1UL << 21)
#define SAMD_SERCOM3_BIT_22 (1UL << 22)
#define SAMD_SERCOM3_BIT_23 (1UL << 23)
#define SAMD_SERCOM3_BIT_24 (1UL << 24)
#define SAMD_SERCOM3_BIT_25 (1UL << 25)
#define SAMD_SERCOM3_BIT_26 (1UL << 26)
#define SAMD_SERCOM3_BIT_27 (1UL << 27)
#define SAMD_SERCOM3_BIT_28 (1UL << 28)
#define SAMD_SERCOM3_BIT_29 (1UL << 29)
#define SAMD_SERCOM3_BIT_30 (1UL << 30)
#define SAMD_SERCOM3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM4_TypeDef;
#define SAMD_SERCOM4 ((SAMD_SERCOM4_TypeDef *)(0x42000800UL + 4 * 0x400UL))

#define SAMD_SERCOM4_BIT_0 (1UL << 0)
#define SAMD_SERCOM4_BIT_1 (1UL << 1)
#define SAMD_SERCOM4_BIT_2 (1UL << 2)
#define SAMD_SERCOM4_BIT_3 (1UL << 3)
#define SAMD_SERCOM4_BIT_4 (1UL << 4)
#define SAMD_SERCOM4_BIT_5 (1UL << 5)
#define SAMD_SERCOM4_BIT_6 (1UL << 6)
#define SAMD_SERCOM4_BIT_7 (1UL << 7)
#define SAMD_SERCOM4_BIT_8 (1UL << 8)
#define SAMD_SERCOM4_BIT_9 (1UL << 9)
#define SAMD_SERCOM4_BIT_10 (1UL << 10)
#define SAMD_SERCOM4_BIT_11 (1UL << 11)
#define SAMD_SERCOM4_BIT_12 (1UL << 12)
#define SAMD_SERCOM4_BIT_13 (1UL << 13)
#define SAMD_SERCOM4_BIT_14 (1UL << 14)
#define SAMD_SERCOM4_BIT_15 (1UL << 15)
#define SAMD_SERCOM4_BIT_16 (1UL << 16)
#define SAMD_SERCOM4_BIT_17 (1UL << 17)
#define SAMD_SERCOM4_BIT_18 (1UL << 18)
#define SAMD_SERCOM4_BIT_19 (1UL << 19)
#define SAMD_SERCOM4_BIT_20 (1UL << 20)
#define SAMD_SERCOM4_BIT_21 (1UL << 21)
#define SAMD_SERCOM4_BIT_22 (1UL << 22)
#define SAMD_SERCOM4_BIT_23 (1UL << 23)
#define SAMD_SERCOM4_BIT_24 (1UL << 24)
#define SAMD_SERCOM4_BIT_25 (1UL << 25)
#define SAMD_SERCOM4_BIT_26 (1UL << 26)
#define SAMD_SERCOM4_BIT_27 (1UL << 27)
#define SAMD_SERCOM4_BIT_28 (1UL << 28)
#define SAMD_SERCOM4_BIT_29 (1UL << 29)
#define SAMD_SERCOM4_BIT_30 (1UL << 30)
#define SAMD_SERCOM4_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM5_TypeDef;
#define SAMD_SERCOM5 ((SAMD_SERCOM5_TypeDef *)(0x42000800UL + 5 * 0x400UL))

#define SAMD_SERCOM5_BIT_0 (1UL << 0)
#define SAMD_SERCOM5_BIT_1 (1UL << 1)
#define SAMD_SERCOM5_BIT_2 (1UL << 2)
#define SAMD_SERCOM5_BIT_3 (1UL << 3)
#define SAMD_SERCOM5_BIT_4 (1UL << 4)
#define SAMD_SERCOM5_BIT_5 (1UL << 5)
#define SAMD_SERCOM5_BIT_6 (1UL << 6)
#define SAMD_SERCOM5_BIT_7 (1UL << 7)
#define SAMD_SERCOM5_BIT_8 (1UL << 8)
#define SAMD_SERCOM5_BIT_9 (1UL << 9)
#define SAMD_SERCOM5_BIT_10 (1UL << 10)
#define SAMD_SERCOM5_BIT_11 (1UL << 11)
#define SAMD_SERCOM5_BIT_12 (1UL << 12)
#define SAMD_SERCOM5_BIT_13 (1UL << 13)
#define SAMD_SERCOM5_BIT_14 (1UL << 14)
#define SAMD_SERCOM5_BIT_15 (1UL << 15)
#define SAMD_SERCOM5_BIT_16 (1UL << 16)
#define SAMD_SERCOM5_BIT_17 (1UL << 17)
#define SAMD_SERCOM5_BIT_18 (1UL << 18)
#define SAMD_SERCOM5_BIT_19 (1UL << 19)
#define SAMD_SERCOM5_BIT_20 (1UL << 20)
#define SAMD_SERCOM5_BIT_21 (1UL << 21)
#define SAMD_SERCOM5_BIT_22 (1UL << 22)
#define SAMD_SERCOM5_BIT_23 (1UL << 23)
#define SAMD_SERCOM5_BIT_24 (1UL << 24)
#define SAMD_SERCOM5_BIT_25 (1UL << 25)
#define SAMD_SERCOM5_BIT_26 (1UL << 26)
#define SAMD_SERCOM5_BIT_27 (1UL << 27)
#define SAMD_SERCOM5_BIT_28 (1UL << 28)
#define SAMD_SERCOM5_BIT_29 (1UL << 29)
#define SAMD_SERCOM5_BIT_30 (1UL << 30)
#define SAMD_SERCOM5_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM6_TypeDef;
#define SAMD_SERCOM6 ((SAMD_SERCOM6_TypeDef *)(0x42000800UL + 6 * 0x400UL))

#define SAMD_SERCOM6_BIT_0 (1UL << 0)
#define SAMD_SERCOM6_BIT_1 (1UL << 1)
#define SAMD_SERCOM6_BIT_2 (1UL << 2)
#define SAMD_SERCOM6_BIT_3 (1UL << 3)
#define SAMD_SERCOM6_BIT_4 (1UL << 4)
#define SAMD_SERCOM6_BIT_5 (1UL << 5)
#define SAMD_SERCOM6_BIT_6 (1UL << 6)
#define SAMD_SERCOM6_BIT_7 (1UL << 7)
#define SAMD_SERCOM6_BIT_8 (1UL << 8)
#define SAMD_SERCOM6_BIT_9 (1UL << 9)
#define SAMD_SERCOM6_BIT_10 (1UL << 10)
#define SAMD_SERCOM6_BIT_11 (1UL << 11)
#define SAMD_SERCOM6_BIT_12 (1UL << 12)
#define SAMD_SERCOM6_BIT_13 (1UL << 13)
#define SAMD_SERCOM6_BIT_14 (1UL << 14)
#define SAMD_SERCOM6_BIT_15 (1UL << 15)
#define SAMD_SERCOM6_BIT_16 (1UL << 16)
#define SAMD_SERCOM6_BIT_17 (1UL << 17)
#define SAMD_SERCOM6_BIT_18 (1UL << 18)
#define SAMD_SERCOM6_BIT_19 (1UL << 19)
#define SAMD_SERCOM6_BIT_20 (1UL << 20)
#define SAMD_SERCOM6_BIT_21 (1UL << 21)
#define SAMD_SERCOM6_BIT_22 (1UL << 22)
#define SAMD_SERCOM6_BIT_23 (1UL << 23)
#define SAMD_SERCOM6_BIT_24 (1UL << 24)
#define SAMD_SERCOM6_BIT_25 (1UL << 25)
#define SAMD_SERCOM6_BIT_26 (1UL << 26)
#define SAMD_SERCOM6_BIT_27 (1UL << 27)
#define SAMD_SERCOM6_BIT_28 (1UL << 28)
#define SAMD_SERCOM6_BIT_29 (1UL << 29)
#define SAMD_SERCOM6_BIT_30 (1UL << 30)
#define SAMD_SERCOM6_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CTRLA, CTRLB, BAUD, INTENCLR, INTENSET, INTFLAG, STATUS, SYNCBUSY, DATA, DBGCTRL, ADDR, LENGTH; } SAMD_SERCOM7_TypeDef;
#define SAMD_SERCOM7 ((SAMD_SERCOM7_TypeDef *)(0x42000800UL + 7 * 0x400UL))

#define SAMD_SERCOM7_BIT_0 (1UL << 0)
#define SAMD_SERCOM7_BIT_1 (1UL << 1)
#define SAMD_SERCOM7_BIT_2 (1UL << 2)
#define SAMD_SERCOM7_BIT_3 (1UL << 3)
#define SAMD_SERCOM7_BIT_4 (1UL << 4)
#define SAMD_SERCOM7_BIT_5 (1UL << 5)
#define SAMD_SERCOM7_BIT_6 (1UL << 6)
#define SAMD_SERCOM7_BIT_7 (1UL << 7)
#define SAMD_SERCOM7_BIT_8 (1UL << 8)
#define SAMD_SERCOM7_BIT_9 (1UL << 9)
#define SAMD_SERCOM7_BIT_10 (1UL << 10)
#define SAMD_SERCOM7_BIT_11 (1UL << 11)
#define SAMD_SERCOM7_BIT_12 (1UL << 12)
#define SAMD_SERCOM7_BIT_13 (1UL << 13)
#define SAMD_SERCOM7_BIT_14 (1UL << 14)
#define SAMD_SERCOM7_BIT_15 (1UL << 15)
#define SAMD_SERCOM7_BIT_16 (1UL << 16)
#define SAMD_SERCOM7_BIT_17 (1UL << 17)
#define SAMD_SERCOM7_BIT_18 (1UL << 18)
#define SAMD_SERCOM7_BIT_19 (1UL << 19)
#define SAMD_SERCOM7_BIT_20 (1UL << 20)
#define SAMD_SERCOM7_BIT_21 (1UL << 21)
#define SAMD_SERCOM7_BIT_22 (1UL << 22)
#define SAMD_SERCOM7_BIT_23 (1UL << 23)
#define SAMD_SERCOM7_BIT_24 (1UL << 24)
#define SAMD_SERCOM7_BIT_25 (1UL << 25)
#define SAMD_SERCOM7_BIT_26 (1UL << 26)
#define SAMD_SERCOM7_BIT_27 (1UL << 27)
#define SAMD_SERCOM7_BIT_28 (1UL << 28)
#define SAMD_SERCOM7_BIT_29 (1UL << 29)
#define SAMD_SERCOM7_BIT_30 (1UL << 30)
#define SAMD_SERCOM7_BIT_31 (1UL << 31)
#ifdef __cplusplus
}
#endif
#endif
